Сортировка пузырьком: 203.29860305786
Сортировка вставками: 402.57960104942
Сортировка расческой: 0.29721903800964
Сортировка слиянием: 2.5502941608429
Сортировка пирамидальная: 0.27539706230164
Сортировка пирамидальная SPL: 0.051604032516479
Сортировка быстрая наша: 0.12636709213257
Сортировка быстрая чужая: 0.070630788803101
Сортировка из PHP: 0.01993989944458
Сортировка выбором: 100.09832191467
Сортировка голубиная: 0.031132936477661


при сортировке массива из миллиона элементов даже я че то приуныл, не говоря уж о компьютере , поэтому использовал 100 тыс. элементов...
похоже, sort() вполне себе нормальная сортировка, которой можно пользоваться и не париться